[
  {
    "review": "Tried many but Pebbled simply the best when it comes to helping a freelancer scale into a full blown digital agency, it’s as if I have a whole team of designers for my 1 person army!",
    "name": "Solloh Venidoh",
    "img": "",
    "stars": "",
    "slug": "sollohven"
  },
  {
    "review": "Signed up to get a design done for an online commerce store, was a great service and the platform was really easy to navigate around.",
    "name": "Torsten Neilsen",
    "img": "",
    "stars": "",
    "slug": "torstennie"
  },
  {
    "review": "I’ve been with Pebbled for a few years now, I continue to see positive changes in their platforms, communication and designers skills. Can’t really complain for the price I’m paying.",
    "name": "Matthew Smith",
    "img": "",
    "stars": "",
    "slug": "matthewsmi"
  },
  {
    "review": "I jumped on Pebbled for some designs done for our Students at our music school, mostly concert posters and so forth. I like that you know what you’re paying each month and can consistently keep posting design jobs. Great, super fast customer service. Quickest, smoothest chat process I've experienced with designers... maybe ever. And I'm happy with the designs and the price I pay for it.",
    "name": "Robert Trujillo",
    "img": "",
    "stars": "",
    "slug": "roberttru"
  },
  {
    "review": "I am happy with my subscription so far. Very helpful for anyone needing ongoing designs! Quick and efficient. Thank you!",
    "name": "Tyler Sutton",
    "img": "",
    "stars": "",
    "slug": "tylersu"
  },
  {
    "review": "The designs I’ve had done thus far in my first month have been fantastic, the designers are always quick to respond to any questions. It’s been a great experience.",
    "name": "Michael Partridge",
    "img": "",
    "stars": "",
    "slug": "michaelp"
  },
  {
    "review": "Superfast delivery and great customer service. Highly recommended for any medium sized digital agencies or designers wanting to free up their own time.",
    "name": "Mark Grafin",
    "img": "",
    "stars": "",
    "slug": "markgra"
  },
  {
    "review": "Very professional. Would definitely recommend it. Relied upon by several clients of mine and they didn’t disappoint.Always happy to praise the great team and Pebbled definitely are. Excellent service from some genuinely nice people.",
    "name": "Clarke Jason",
    "img": "",
    "stars": "",
    "slug": "clarke"
  },
  {
    "review": "I have found Pebbled to be easy to use and when I had a question the support team were very efficient and quick in helping me.",
    "name": "Ms Amelia ",
    "img": "",
    "stars": "",
    "slug": "amelia"
  },
  {
    "review": "Customer service was very quick to respond to me when contacting Pebbled with a plethora of questions. They were very helpful, thorough and knowledgeable. They listened to what I was asking, responded in a detailed manner and have been very pleasant to work with. I have been with Pebbled for over 1 year now and would definitely recommend them to others. After first hearing about them from my weekly networking group it appeared almost networker I knew was talking about them, I had no hesitation signing up to my enterprise plan after having such great success during my trial, within a couple of days there were some issues with my inventory tracker on my website and Pebbled had this fixed within a few hours, their customer service team are very quick and always available, any issues we encounter with our website they’re quickly resolved and so far all is good, the payments are like clockwork ,customer service is excellent, i felt i was speaking to humans, it seems to be the nature of the beast, I am using Pebbled on 3 websites and i am more than happy with the service so far, many thanks Pebbled, we hope to use you for many years to come.",
    "name": "Ashley Rosa",
    "img": "",
    "stars": "",
    "slug": "ashley"
  },
  {
    "review": "I like that there are various levels of designers available. This company seems to have higher quality designers over the competitors I’m currently trying out.",
    "name": "Mark Thomson",
    "img": "",
    "stars": "",
    "slug": "thomson"
  },
  {
    "review": "Pebbled has been a game changer for our organization! We love it. The designs are great and the turnaround is as expected for the types of designs we get done!",
    "name": "David James",
    "img": "",
    "stars": "",
    "slug": "davidj"
  },
  {
    "review": "I cannot fault Pebbled or their team and service. I've used their design team ongoingly for various menu changes and sport promotional flyers for our bar, not to mention last minute changes for band lineup posters. They're always quick to respond to any design requests, any designs I get done through them only require minimal revisions if any.",
    "name": "David D",
    "img": "",
    "stars": "",
    "slug": "davidd"
  },
  {
    "review": "Pebbled has made it incredibly easy for my online store to accept payments from clients. I recently ran into a snag with a client who wanted a refund due to my checkout page not working properly and accidentally processed a card multiple times, Pebbled came to the rescue by designing and developing a new single page checkout and making sure all my stripe integrations worked correctly for my shopify website. Pebbled were easy-to-use, and since I have not had any clients complain about my website or checkout process.",
    "name": "David Rack",
    "img": "",
    "stars": "",
    "slug": "davidra"
  },
  {
    "review": "I’ve just gone from my trial to the paid plus plan and have already had a few html concepts come through, so far the team have been pretty solid, it’s been a better experience than a previous creative agency I used. Really enjoying the flexibility where I can keep bouncing stuff back and forth until it’s exactly how I want it.",
    "name": "Thomas Reily",
    "img": "",
    "stars": "",
    "slug": "thomasre"
  },
  {
    "review": "The turnaround time was quick and fast. I was impressed with their work but mainly the speed is what makes this service great.",
    "name": "Robert A",
    "img": "",
    "stars": "",
    "slug": "roberta"
  },
  {
    "review": "We’ve used Pebbled for maybe over 2 years now for our agency and they just keep getting better and better. Designs are phenomenal, development is clean and always done in a reasonable timeframe, support is quick to respond to any questions.",
    "name": "Vania Valencia",
    "img": "",
    "stars": "",
    "slug": "vania"
  },
  {
    "review": "I came off a bad run of using Freelancers from upwork and also using people from Fiverr for quick fixes, however never had a decent result, in fact every time was an absolute headache and I never got the results I wanted, Pebbled have been a great resource, for us it works",
    "name": "Emma Fiona",
    "img": "",
    "stars": "",
    "slug": "emmafi"
  },
  {
    "review": "I couldn’t recommend pebbled enough for an agency, we’ve been using them for roughly 2 years now for designs and the odd development job here and there, this industry is tough and Pebbled have the years on the board and have really stuck it out, I trust pebbled with my agency and you should to. Time frames are a lot faster than they mention and the support team has always been lovely.",
    "name": "Christopher Doval",
    "img": "",
    "stars": "",
    "slug": "christopherd"
  },
  {
    "review": "I'd recommend 100% Pebbled. I get asked about them regularly inside my mastermind groups and am always referring clients to them. It's easy to understand why once you see the quality of their work even inside their free trial, they’re very reliable when you need that urgent Q&A. Or maybe for that one urgent presentation of infographic. You'll end up loving all the design options available",
    "name": "Jack Medved",
    "img": "",
    "stars": "",
    "slug": "jackmed"
  },
  {
    "review": "We couldn't do our business the way we do it - without our Pebbled subscription. From one bootstrapped startup to another, this is an incredible asset to our agency and we just couldn’t service our clients without using Pebbled, the quality has been awesome and their support team have been super lovely to work with always.",
    "name": "Clara Miller",
    "img": "",
    "stars": "",
    "slug": "clarami"
  }
]
