[
  {
    "id": 0,
    "name": "Steve",
    "link": "https://www.linkedin.com/",
    "img": "/team/members/steve.jpg",
    "role": "General Manager",
    "bio": "Steve Smith is the Dainty General Manager with more than 10 years of team management experience in the Wholesale and Hospitality industries. He is a perfectionist when it comes to our clients needs as he works extremely close with our Development Team to provide a quality experience from start to finish. \nSteve is a very approachable member of the Dainty family and makes working with him very enjoyable and easy going. He always has a positive outlook and brings a great energy to our team which is seen in everything we do."
  },
  {
    "id": 1,
    "name": "Kevin",
    "link": "https://www.linkedin.com/",
    "img": "/team/members/kevin.jpg",
    "role": "Account Manager",
    "bio": "Kevin’s genuine positive energy is evident in all interactions he has with clients as well as staff every day. He’s appreciative mental attitude helps the team ease tension in high pressure situations and refocuses it back into achieving businesses and personal goals in a holistic manner.\nKevin’s people first mentality has made him a good listener with clients and staff relationships, he is consistently able to give his full undivided attention whenever needed. He is usually the vital thread between our digital services and our client relationships, always making sure everyone is heard, respected and understood. Kevin is committed to delivering the best experience possible to clients and staff."
  },
  {
    "id": 2,
    "name": "Valeria",
    "link": "https://www.linkedin.com/",
    "img": "/team/members/valeria.jpg",
    "role": "Developer",
    "bio": "Valeria is focused, professional and hard working. Her ability to come up with the best solution that fits client’s needs is second to none. She ensures every last detail is taken care of from beginning to end of development. Valeria is always happy to help out (even when she’s not on the clock), and proves that every problem has a solution if you’re invested in finding one."
  },
  {
    "id": 3,
    "name": "John",
    "link": "https://www.linkedin.com/in/johnnguyen05/",
    "img": "/team/members/john.jpg",
    "role": "Financial manager",
    "bio": "John is a results-driven professional with continuous success demonstrated by his owner operating abilities for a restaurant. He is the financial officer of Dainty who doesn't crack under any pressure.  He also has previous experience in providing physical and mental support for others. He’s curiosity and persistence to take on opportunities has allowed him to master and develop greater knowledge and skills about every aspect of the business world. He’s detail-oriented and motivated who can quickly grasp concepts and ideas, implementing innovative practices and procedures to improve efficiency. He’s a committed and effective team player with excellent leadership and interpersonal skills prioritising company culture to drive quality and outcome."
  }
]
